output/load-test/api-read-200vus.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: api-read.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * api_read: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 0 complete and 0 interrupted iterations
api_read   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 1 complete and 0 interrupted iterations
api_read   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 1 complete and 0 interrupted iterations
api_read   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 20 complete and 0 interrupted iterations
api_read   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 27 complete and 0 interrupted iterations
api_read   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 33 complete and 0 interrupted iterations
api_read   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 44 complete and 0 interrupted iterations
api_read   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 60 complete and 0 interrupted iterations
api_read   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 80 complete and 0 interrupted iterations
api_read   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 143 complete and 0 interrupted iterations
api_read   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 238 complete and 0 interrupted iterations
api_read   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 324 complete and 0 interrupted iterations
api_read   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 324 complete and 0 interrupted iterations
api_read   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 325 complete and 0 interrupted iterations
api_read   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 329 complete and 0 interrupted iterations
api_read   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 341 complete and 0 interrupted iterations
api_read   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 398 complete and 0 interrupted iterations
api_read   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 513 complete and 0 interrupted iterations
api_read   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 651 complete and 0 interrupted iterations
api_read   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 799 complete and 0 interrupted iterations
api_read   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 947 complete and 0 interrupted iterations
api_read   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 1095 complete and 0 interrupted iterations
api_read   [ 100% ] 200 VUs  30.0s/30s

running (0m31.0s), 052/200 VUs, 1243 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 200 VUs  30s

running (0m32.0s), 052/200 VUs, 1243 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 200 VUs  30s

running (0m33.0s), 052/200 VUs, 1243 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 200 VUs  30s

running (0m34.0s), 052/200 VUs, 1243 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 200 VUs  30s

running (0m35.0s), 052/200 VUs, 1243 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 200 VUs  30s

running (0m36.0s), 051/200 VUs, 1244 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 200 VUs  30s

running (0m37.0s), 023/200 VUs, 1272 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 200 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=3.5s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 12950  342.465228/s
    checks_succeeded...: 96.49% 12496 out of 12950
    checks_failed......: 3.50%  454 out of 12950

    ✓ 设备列表 成功
    ✗ 设备列表 P95<500ms
      ↳  87% — ✓ 1135 / ✗ 160
    ✓ 告警列表 成功
    ✗ 告警列表 P95<500ms
      ↳  94% — ✓ 1225 / ✗ 70
    ✓ 工单列表 成功
    ✗ 工单列表 P95<500ms
      ↳  96% — ✓ 1251 / ✗ 44
    ✓ 仪表盘统计 成功
    ✗ 仪表盘统计 P95<500ms
      ↳  87% — ✓ 1136 / ✗ 159
    ✓ 通知列表 成功
    ✗ 通知列表 P95<500ms
      ↳  98% — ✓ 1274 / ✗ 21

    HTTP
    http_req_duration..............: avg=769.07ms min=851µs med=2.02ms max=36.69s p(90)=493.13ms p(95)=3.5s  
      { expected_response:true }...: avg=769.07ms min=851µs med=2.02ms max=36.69s p(90)=493.13ms p(95)=3.5s  
    http_req_failed................: 0.00%  0 out of 6675
    http_reqs......................: 6675   176.521652/s

    EXECUTION
    iteration_duration.............: avg=4.96s    min=1s    med=1.01s  max=37.8s  p(90)=17.14s   p(95)=26.05s
    iterations.....................: 1295   34.246523/s
    vus............................: 23     min=23        max=200
    vus_max........................: 200    min=200       max=200

    NETWORK
    data_received..................: 50 MB  1.3 MB/s
    data_sent......................: 5.0 MB 133 kB/s



running (0m37.8s), 000/200 VUs, 1295 complete and 0 interrupted iterations
api_read ✓ [ 100% ] 200 VUs  30s
time="2026-06-17T20:34:08+08:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"